# Introduction to SQLite
SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.

## Connect and Create a New Database 

First, we need to create a new database and open a database connection to allow sqlite3 to work with it. Call `sqlite3.connect()` to to create a connection to the database `users.db` in the current working directory, implicitly creating it if it does not exist:

In [ ]:
import sqlite3

In [ ]:
import sqlite3
# create a connection to the database students.db
con = sqlite3.connect('student.db')

In [ ]:
type(con)

sqlite3.Connection

*__The returned Connection object con represents the connection to the on-disk database.__*

In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor. 

Call `con.cursor()` to create the Cursor:

A Cursor is an object that represents a database cursor which is used to execute SQL statements, 
and manage the context of a fetch operation. Cursors are created using `Connection.cursor()`.

In [ ]:
cursor = con.cursor()

    C : Create 
    R : Read
    U : Update
    I : Insert
    D : Delete
    
```python
import sqlite3
con = sqlite3.connect("students.db")
cur = con.cursor()
```

# Create table on SQL


```sql
Create Table table_name(column_names)
```

Example:

```sql
Create Table movies(name, genere, release_year, ratings)
```

You can define data types and Required fields and primary keys while creating tables 
For Example:


```sql
CREATE TABLE movies
(name VARCHAR(50) NOT NULL,
 genre, 
 release_year INT, 
 ratings INT,
PRIMARY KEY(name));
```

Another Example:

```sql
CREATE TABLE movies(name VARCHAR(50) NOT NULL,
                    genre VARCHAR(30) NOT NULL,
                    director VARCHAR(60) NOT NULL,
                    release_year INT NOT NULL, 
                    ratings INT, PRIMARY KEY(name));
```

In [ ]:
import sqlite3
con = sqlite3.connect("student.db")
cur = con.cursor()

In [ ]:
query = """
create table students(roll_no int not null, name, gender)
"""

In [ ]:
cur.execute(query)

# The MySQL INSERT INTO Statement

Create movies table first to insert data on it.

Syntax:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...),
(value11, value12, value13, ...);
```


# Executemany/ Insert
```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (?, ?, ?, ...);
```

In [ ]:
insert_query = """
insert into students (roll_no,name, gender)
values
(1, 'Santosh', 'M'),
(2, 'Dhurba', 'M'),
(3, 'Aayusha', 'F')
"""

In [ ]:
cur.execute(insert_query)

# SELECT Statement in MYSQL Database/ Read the table

```sql
SELECT * FROM TABLE_NAME;
```

In [ ]:
read_query = """
select * from students
"""

In [ ]:
cur.execute(read_query).fetchall()

[(1, 'Santosh', 'M'), (2, 'Dhurba', 'M'), (3, 'Aayusha', 'F')]

In [ ]:
cur.execute("select * from students where gender = 'F'").fetchall()

[(3, 'Aayusha', 'F')]

# Update statement in MYSQL


```sql
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition; 
```

In [ ]:
# students (roll_no,name, gender)

In [ ]:
update_query = """
update students 
set name = 'Shyam kumar'
where 
roll_no = 2
"""

In [ ]:
cur.execute(update_query)

In [ ]:
cur.execute("select * from students").fetchall()

[(1, 'Santosh', 'M'), (2, 'Shyam kumar', 'M'), (3, 'Aayusha', 'F')]

# Delete statement in MYSQL


```sql
Delete from table_name
WHERE condition; 
```

In [ ]:
delete_query = "delete from students where roll_no = 2"

In [ ]:
cur.execute(delete_query)

In [ ]:
cur.execute("select * from students").fetchall()

[(1, 'Santosh', 'M'), (3, 'Aayusha', 'F')]